aureoleday/grating/bsp/stm32/acc_tx/usr/drv/rtcan_drv.c
    switch (cmd)
    {
    case RT_DEVICE_CTRL_CLR_INT:
        argval = (rt_uint32_t) arg;
        if (argval == RT_DEVICE_FLAG_INT_RX)
        {
#ifdef USING_BXCAN1
            if (CAN1 == drv_can->CanHandle.Instance)
			{
                HAL_NVIC_DisableIRQ(CAN1_RX0_IRQn);
                HAL_NVIC_DisableIRQ(CAN1_RX1_IRQn);
            }
#endif /* USING_BXCAN1 */

#ifdef USING_BXCAN2
            if (CAN2 == drv_can->CanHandle.Instance)
            {
                HAL_NVIC_DisableIRQ(CAN2_RX0_IRQn);
                HAL_NVIC_DisableIRQ(CAN2_RX1_IRQn);
            }
#endif /* USING_BXCAN2 */

            __HAL_CAN_DISABLE_IT(&drv_can->CanHandle, CAN_IT_FMP0);
            __HAL_CAN_DISABLE_IT(&drv_can->CanHandle, CAN_IT_FF0 );
            __HAL_CAN_DISABLE_IT(&drv_can->CanHandle, CAN_IT_FOV0);
            __HAL_CAN_DISABLE_IT(&drv_can->CanHandle, CAN_IT_FMP1);
            __HAL_CAN_DISABLE_IT(&drv_can->CanHandle, CAN_IT_FF1 );
            __HAL_CAN_DISABLE_IT(&drv_can->CanHandle, CAN_IT_FOV1);
        }
        else if (argval == RT_DEVICE_FLAG_INT_TX)
        {        
#ifdef USING_BXCAN1
            if (CAN1 == drv_can->CanHandle.Instance)
            {
                HAL_NVIC_DisableIRQ(CAN1_TX_IRQn);
            }
#endif /* USING_BXCAN1 */

#ifdef USING_BXCAN2
            if (CAN2 == drv_can->CanHandle.Instance)
            {
                HAL_NVIC_DisableIRQ(CAN2_TX_IRQn);
            }
#endif /* USING_BXCAN2 */

            __HAL_CAN_DISABLE_IT(&drv_can->CanHandle, CAN_IT_TME);
        }
        else if (argval == RT_DEVICE_CAN_INT_ERR)
        {        
#ifdef USING_BXCAN1
            if (CAN1 == drv_can->CanHandle.Instance)
            {
                NVIC_DisableIRQ(CAN1_SCE_IRQn);
            }
#endif /* USING_BXCAN1 */

#ifdef USING_BXCAN2
            if (CAN2 == drv_can->CanHandle.Instance)
            {
                NVIC_DisableIRQ(CAN2_SCE_IRQn);
            }
#endif /* USING_BXCAN2 */

            __HAL_CAN_DISABLE_IT(&drv_can->CanHandle, CAN_IT_BOF);
            __HAL_CAN_DISABLE_IT(&drv_can->CanHandle, CAN_IT_LEC);
            __HAL_CAN_DISABLE_IT(&drv_can->CanHandle, CAN_IT_ERR);
        }
        break;
    case RT_DEVICE_CTRL_SET_INT:
        argval = (rt_uint32_t) arg;
        if (argval == RT_DEVICE_FLAG_INT_RX)
        {
            __HAL_CAN_ENABLE_IT(&drv_can->CanHandle, CAN_IT_FMP0);
            __HAL_CAN_ENABLE_IT(&drv_can->CanHandle, CAN_IT_FF0);
            __HAL_CAN_ENABLE_IT(&drv_can->CanHandle, CAN_IT_FOV0);
            __HAL_CAN_ENABLE_IT(&drv_can->CanHandle, CAN_IT_FMP1);
            __HAL_CAN_ENABLE_IT(&drv_can->CanHandle, CAN_IT_FF1);
            __HAL_CAN_ENABLE_IT(&drv_can->CanHandle, CAN_IT_FOV1);

#ifdef USING_BXCAN1
            if (CAN1 == drv_can->CanHandle.Instance)
            {
                HAL_NVIC_SetPriority(CAN1_RX0_IRQn, 1, 0);
                HAL_NVIC_EnableIRQ(CAN1_RX0_IRQn);
                HAL_NVIC_SetPriority(CAN1_RX1_IRQn, 1, 0);
                HAL_NVIC_EnableIRQ(CAN1_RX1_IRQn);
            }
#endif /* USING_BXCAN1 */

#ifdef USING_BXCAN2
            if (CAN2 == drv_can->CanHandle.Instance)
            {
                HAL_NVIC_SetPriority(CAN2_RX0_IRQn, 1, 0);
                HAL_NVIC_EnableIRQ(CAN2_RX0_IRQn);
                HAL_NVIC_SetPriority(CAN2_RX1_IRQn, 1, 0);
                HAL_NVIC_EnableIRQ(CAN2_RX1_IRQn);
            }
#endif /* USING_BXCAN2 */
        }
        else if (argval == RT_DEVICE_FLAG_INT_TX)
        {
            __HAL_CAN_ENABLE_IT(&drv_can->CanHandle, CAN_IT_TME);

#ifdef USING_BXCAN1
            if (CAN1 == drv_can->CanHandle.Instance)
            {
                HAL_NVIC_SetPriority(CAN1_TX_IRQn, 1, 0);
                HAL_NVIC_EnableIRQ(CAN1_TX_IRQn);
            }
#endif /* USING_BXCAN1 */

#ifdef USING_BXCAN2
            if (CAN2 == drv_can->CanHandle.Instance)
            {
                HAL_NVIC_SetPriority(CAN2_TX_IRQn, 1, 0);
                HAL_NVIC_EnableIRQ(CAN2_TX_IRQn);
            }
#endif /* USING_BXCAN2 */
        }
        else if (argval == RT_DEVICE_CAN_INT_ERR)
        {
            __HAL_CAN_ENABLE_IT(&drv_can->CanHandle, CAN_IT_BOF);
            __HAL_CAN_ENABLE_IT(&drv_can->CanHandle, CAN_IT_LEC);
            __HAL_CAN_ENABLE_IT(&drv_can->CanHandle, CAN_IT_ERR);

#ifdef USING_BXCAN1
            if (CAN1 == drv_can->CanHandle.Instance)
            {
                HAL_NVIC_SetPriority(CAN1_SCE_IRQn, 1, 0);
                HAL_NVIC_EnableIRQ(CAN1_SCE_IRQn);
            }
#endif /* USING_BXCAN1 */

#ifdef USING_BXCAN2
            if (CAN2 == drv_can->CanHandle.Instance)
            {
                HAL_NVIC_SetPriority(CAN2_SCE_IRQn, 1, 0);
                HAL_NVIC_EnableIRQ(CAN2_SCE_IRQn);
            }
#endif /* USING_BXCAN2 */
        }
        break;
    case RT_CAN_CMD_SET_FILTER:
        /* TODO: filter*/
        break;
    case RT_CAN_CMD_SET_MODE:
        argval = (rt_uint32_t) arg;
        if (argval != RT_CAN_MODE_NORMAL ||
            argval != RT_CAN_MODE_LISEN ||
            argval != RT_CAN_MODE_LOOPBACK ||
            argval != RT_CAN_MODE_LOOPBACKANLISEN)
        {
            return RT_ERROR;
        }
        if (argval != can->config.mode)
        {
            can->config.mode = argval;
            if (HAL_CAN_Init(&drv_can->CanHandle) != HAL_OK)
            {
                return RT_ERROR;
            }
        }
        break;
    case RT_CAN_CMD_SET_BAUD:
        argval = (rt_uint32_t) arg;
        if (argval != CAN1MBaud &&
            argval != CAN800kBaud &&
            argval != CAN500kBaud &&
            argval != CAN250kBaud &&
            argval != CAN125kBaud &&
            argval != CAN100kBaud &&
            argval != CAN50kBaud  &&
            argval != CAN20kBaud  &&
            argval != CAN10kBaud)
        {
            return RT_ERROR;
        }
        if (argval != can->config.baud_rate)
        {
            CAN_InitTypeDef *drv_init;
            rt_uint32_t baud_index;

            can->config.baud_rate = argval;

            drv_init = &drv_can->CanHandle.Init;

            drv_init->TTCM = DISABLE;
            drv_init->ABOM = DISABLE;
            drv_init->AWUM = DISABLE;
            drv_init->NART = DISABLE;
            drv_init->RFLM = DISABLE;
            drv_init->TXFP = DISABLE;
            baud_index = get_can_baud_index(can->config.baud_rate);
            drv_init->SJW = BAUD_DATA(SJW, baud_index);
            drv_init->BS1 = BAUD_DATA(BS1, baud_index);
            drv_init->BS2 = BAUD_DATA(BS2, baud_index);
            drv_init->Prescaler = BAUD_DATA(RRESCL, baud_index);

            if (HAL_CAN_Init(&drv_can->CanHandle) != HAL_OK)
            {
                return RT_ERROR;
            }
        }
        break;
    case RT_CAN_CMD_SET_PRIV:
        argval = (rt_uint32_t) arg;
        if (argval != RT_CAN_MODE_PRIV ||
            argval != RT_CAN_MODE_NOPRIV)
        {
            return RT_ERROR;
        }
        if (argval != can->config.privmode)
        {
            can->config.privmode = argval;
            if (HAL_CAN_Init(&drv_can->CanHandle) != HAL_OK)
            {
                return RT_ERROR;
            }
        }
        break;
    case RT_CAN_CMD_GET_STATUS:
    {
        rt_uint32_t errtype;
        errtype = drv_can->CanHandle.Instance->ESR;
        can->status.rcverrcnt = errtype >> 24;
        can->status.snderrcnt = (errtype >> 16 & 0xFF);
        can->status.errcode = errtype & 0x07;
        if (arg != &can->status)
        {
            rt_memcpy(arg, &can->status, sizeof(can->status));
        }
    }
    break;
    }

