aureoleday/grating/bsp/stm32/acc_tx/usr/drv/rtcan_drv.c
    return RT_EOK;
}

static int drv_sendmsg(struct rt_can_device *can, const void *buf, rt_uint32_t boxno)
{
    CAN_HandleTypeDef *hcan;
    struct rt_can_msg *pmsg = (struct rt_can_msg *) buf;

    hcan = &((struct stm32_drv_can *) can->parent.user_data)->CanHandle;
    hcan->pTxMsg->StdId = pmsg->id;
    hcan->pTxMsg->ExtId = pmsg->id;
    hcan->pTxMsg->RTR = pmsg->rtr;
    hcan->pTxMsg->IDE = pmsg->ide;
    hcan->pTxMsg->DLC = pmsg->len;
    rt_memset(&hcan->pTxMsg->Data, 0x00, 8);
    /* rt_memcpy(&hcan->pTxMsg->Data, &pmsg->data, 8); */
    hcan->pTxMsg->Data[0] = pmsg->data[0];
    hcan->pTxMsg->Data[1] = pmsg->data[1];
    hcan->pTxMsg->Data[2] = pmsg->data[2];
    hcan->pTxMsg->Data[3] = pmsg->data[3];
    hcan->pTxMsg->Data[4] = pmsg->data[4];
    hcan->pTxMsg->Data[5] = pmsg->data[5];
    hcan->pTxMsg->Data[6] = pmsg->data[6];
    hcan->pTxMsg->Data[7] = pmsg->data[7];
    HAL_CAN_Transmit_IT(hcan);

    return RT_EOK;
}

static int drv_recvmsg(struct rt_can_device *can, void *buf, rt_uint32_t boxno)
{
    CAN_HandleTypeDef *hcan;
    struct rt_can_msg *pmsg = (struct rt_can_msg *) buf;
    hcan = &((struct stm32_drv_can *) can->parent.user_data)->CanHandle;

    pmsg->id = hcan->pRxMsg->StdId;
    pmsg->rtr = hcan->pRxMsg->RTR;
    pmsg->ide = hcan->pRxMsg->IDE;
    pmsg->len = hcan->pRxMsg->DLC;
	if(pmsg->ide != CAN_ID_STD)
	{
		pmsg->id = hcan->pRxMsg->ExtId;
	}
    /* rt_memcpy(&pmsg->data, &hcan->pRxMsg->Data, 8); */
    pmsg->data[0] = hcan->pRxMsg->Data[0];
    pmsg->data[1] = hcan->pRxMsg->Data[1];
    pmsg->data[2] = hcan->pRxMsg->Data[2];
    pmsg->data[3] = hcan->pRxMsg->Data[3];
    pmsg->data[4] = hcan->pRxMsg->Data[4];
    pmsg->data[5] = hcan->pRxMsg->Data[5];
    pmsg->data[6] = hcan->pRxMsg->Data[6];
    pmsg->data[7] = hcan->pRxMsg->Data[7];

    return RT_EOK;
}

static const struct rt_can_ops drv_can_ops =
{
    drv_configure,
    drv_control,
    drv_sendmsg,
    drv_recvmsg,
};

void HAL_CAN_MspInit(CAN_HandleTypeDef* canHandle)
{
    GPIO_InitTypeDef GPIO_InitStruct;
#ifdef USING_BXCAN1
    if(canHandle->Instance==CAN1)
    {
        /* CAN1 clock enable */
        __HAL_RCC_CAN1_CLK_ENABLE();
        __HAL_RCC_GPIOA_CLK_ENABLE();

        /**CAN1 GPIO Configuration
           PA11     ------> CAN1_RX
           PA12     ------> CAN1_TX
        */
        GPIO_InitStruct.Pin = GPIO_PIN_11;
		GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
		GPIO_InitStruct.Pull = GPIO_PULLUP;
		HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

        GPIO_InitStruct.Pin = GPIO_PIN_12;
        GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
        GPIO_InitStruct.Pull = GPIO_NOPULL;
        GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_MEDIUM;
        HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);
    }
#endif /* USING_BXCAN1 */

#ifdef USING_BXCAN2
    if(canHandle->Instance==CAN2)
    {
        /* CAN2 clock enable */
        __HAL_RCC_CAN2_CLK_ENABLE();
        __HAL_RCC_GPIOB_CLK_ENABLE();

        /**CAN2 GPIO Configuration
           PB12     ------> CAN2_RX
           PB6     ------> CAN2_TX
        */
        GPIO_InitStruct.Pin = GPIO_PIN_12|GPIO_PIN_6;
        GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
        GPIO_InitStruct.Pull = GPIO_NOPULL;
        GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
        GPIO_InitStruct.Alternate = GPIO_AF9_CAN2;
        HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);
    }
#endif /* USING_BXCAN2 */
}

void HAL_CAN_MspDeInit(CAN_HandleTypeDef* canHandle)
{
#ifdef USING_BXCAN1
    if(canHandle->Instance==CAN1)
    {
        /* Peripheral clock disable */
        __HAL_RCC_CAN1_CLK_DISABLE();

        /**CAN1 GPIO Configuration
           PA11     ------> CAN1_RX
           PA12     ------> CAN1_TX
        */
        HAL_GPIO_DeInit(GPIOA, GPIO_PIN_11|GPIO_PIN_12);
        HAL_NVIC_DisableIRQ(CAN1_TX_IRQn);
        HAL_NVIC_DisableIRQ(CAN1_RX0_IRQn);
        HAL_NVIC_DisableIRQ(CAN1_RX1_IRQn);
    }
#endif /* USING_BXCAN1 */

#ifdef USING_BXCAN2
    if(canHandle->Instance==CAN2)
    {
        __HAL_RCC_CAN2_CLK_DISABLE();

        /**CAN2 GPIO Configuration
           PB12     ------> CAN2_RX
           PB6     ------> CAN2_TX
        */
        HAL_GPIO_DeInit(GPIOB, GPIO_PIN_12|GPIO_PIN_6);

        HAL_NVIC_DisableIRQ(CAN2_TX_IRQn);
        HAL_NVIC_DisableIRQ(CAN2_RX0_IRQn);
        HAL_NVIC_DisableIRQ(CAN2_RX1_IRQn);
    }
#endif /* USING_BXCAN2 */
}

int hw_can_init(void)
{
    struct stm32_drv_can *drv_can;
    struct can_configure config = CANDEFAULTCONFIG;

    config.privmode = 0;
    config.ticks = 50;
    config.sndboxnumber = 3;
#ifdef RT_CAN_USING_HDR
    config.maxhdr = 28;
#endif

#ifdef USING_BXCAN1
    drv_can = &drv_can1;
    drv_can->CanHandle.Instance = CAN1;
    drv_can->CanHandle.pTxMsg = &drv_can->TxMessage;
    drv_can->CanHandle.pRxMsg = &drv_can->RxMessage;
    dev_can1.ops    = &drv_can_ops;
    dev_can1.config = config;
    /* register CAN1 device */
    rt_hw_can_register(&dev_can1, "can1",
                       &drv_can_ops,
                       drv_can);
#endif /* USING_BXCAN1 */

#ifdef USING_BXCAN2
    drv_can = &drv_can2;
    drv_can->CanHandle.Instance = CAN2;
    drv_can->CanHandle.pTxMsg = &drv_can->TxMessage;
    drv_can->CanHandle.pRxMsg = &drv_can->RxMessage;
    dev_can2.ops    = &drv_can_ops;
    dev_can2.config = config;
    /* register CAN2 device */
    rt_hw_can_register(&dev_can2, "can2",
                       &drv_can_ops,
                       drv_can);
#endif /* USING_BXCAN2 */

    return 0;
}

INIT_BOARD_EXPORT(hw_can_init);
